Revit 2027 API
WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings Method
 Returns the worksharing display settings for the document, creating new settings for the current user if necessary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static WorksharingDisplaySettings GetOrCreateWorksharingDisplaySettings(
	Document doc
)
Public Shared Function GetOrCreateWorksharingDisplaySettings (
	doc As Document
) As WorksharingDisplaySettings
public:
static WorksharingDisplaySettings^ GetOrCreateWorksharingDisplaySettings(
	Document^ doc
)
static member GetOrCreateWorksharingDisplaySettings :
        doc : Document -> WorksharingDisplaySettings
Parameters
doc Document
 The document of interest.
Return Value
WorksharingDisplaySettings
 The worksharing display settings for the document.
Exceptions
Exception | Condition
ArgumentException |  doc is not a project document.
ArgumentNullException |  A non-optional argument was null
Remarks
 Note that these settings are available even in models that are not workshared. This is to allow pre-configuring the display settings before enabling worksets so that they can be stored in template files.
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace